import './Header.scss';
import { Link } from 'react-router-dom';
import MainVisual from './MainVisual';

const OnTopHeader = ({ list }) => {
  return (
    <div className="onTopHeader">
      <div className="container">
        <ul className="top_list">
          {list.map((el, idx) => {
            return (
              <li key={el.id}>
                <Link to={el.link}>
                  {el.title}
                </Link>
              </li>
            )
          })}
        </ul>
      </div>
    </div>
  )
}

const Header = () => {
  const topMenu = [
    { id: 1, title: '메인으로', link: '/' },
    { id: 2, title: '회원가입', link: '/' },
    { id: 3, title: '로그인', link: '/' }
  ]

  const mainMenu = [
    { id: 1, title: '이용안내', link: '/' },
    { id: 2, title: '고객참여', link: '/' },
    { id: 3, title: '문화관광', link: '/' },
    { id: 4, title: '정보공개', link: '/' },
    { id: 5, title: '안전/건설/기술', link: '/' },
    { id: 6, title: '공사소개', link: '/' },
  ]

  const subMenu = [
    {
      id: 1, title: '이용안내', dls: [
        { idx: 1, dt: '노선도', dd: ['노선검색', '노선도 다운로드'], link: '/' },
        { idx: 2, dt: '역정보', dd: ['기본정보', '역세권 정보'], link: '/' },
        { idx: 3, dt: '도시철도 운행정보', dd: ['열차시각표', '열차서행정보'], link: '/' },
        { idx: 4, dt: '유실물센터', dd: ['유실물센터'], link: '/' },
        { idx: 5, dt: '운임정보', dd: ['도시철도 운임', '환승 운임', '수송원가 및 운임결정', '여객운송약관'], link: '/' },
        { idx: 6, dt: '도시철도 이용', dd: ['이용방법', '긴급상황 대피요령'], link: '/' },
        { idx: 7, dt: '교통약자 배려시설', dd: ['엘리베이터', '에스컬레이터', '휠체어리프트', '시각장애인 유도로', '외부경사로', '장애인 화장실', '전동휠체어 금속충전기', '모유수유실'], link: '/' },
        { idx: 8, dt: '승차권 예약', dd: ['단체 승차권', '주문제 승차권', '유아용 교통카드', 'DIY 정기권 카드'], link: '/' },
        { idx: 9, dt: '공익 홍보', dd: ['이용안내'], link: '/' },
        { idx: 10, dt: '부산김해경전철', dd: ['부산김해경전철'], link: '/' }
      ]
    },
    {
      id: 2, title: '고객참여', dls: [
        { idx: 1, dt: '고객의 소리', dd: ['이용안내(FAQ)', '게시판', '글쓰기', '오프라인접수 처리확인', '해우소', '민원편람'], link: '/' },
        { idx: 2, dt: '부산도시철도1번가', dd: ['부산도시철도1번가 안내', '시민 경영제안', '시민에게 물어봄', '시민 참여마당'], link: '/' },
        { idx: 3, dt: '고객모니터', dd: ['고객모니터 안내', '운영실적'], link: '/' },
        { idx: 4, dt: '예산참여방', dd: ['예산참여방 안내', '주민 제안'], link: '/' },
        { idx: 5, dt: '시민톡톡아이디어', dd: ['시민톡톡아이디어 안내', '시민톡톡아이디어 참여하기', '시민톡톡아이디어목록', '우수채택사례'], link: '/' },
        { idx: 6, dt: '연구개발지원사업', dd: ['사업소개', '외부자문위원회', 'Test Bed In HUmetro', '공동연구개발사업'], link: '/' },
        { idx: 7, dt: '도시철도 체험학습', dd: ['이용안내', '예약신청', '예약확인', 'ON-LINE 안전체험 홍보관'], link: '/' },
        { idx: 8, dt: '체육시설 이용', dd: ['이용안내', '예약신청', '예약확인'], link: '/' },
        { idx: 9, dt: '시설물 촬영', dd: ['이용안내', '예약신청', '예약확인'], link: '/' },
        { idx: 10, dt: '청소년자원봉사활동', dd: ['이용안내', '예약신청', '예약확인'], link: '/' },
        { idx: 11, dt: '이벤트', dd: ['이벤트', '우리가 그린(green)영웅'], link: '/' },
        { idx: 12, dt: '찾아가는 안전교육', dd: ['찾아가는 안전교육'], link: '/' },
        { idx: 13, dt: '신고센터', dd: ['부패신고센터', '공익신고센터', '갑질피해 신고 · 상담센터', '시민안전신고센터', '청탁금지법 위반 신고', '공공재정 부정청구등 신고센터'], link: '/' },
        { idx: 13, dt: '엘리베이터 운행정보 알림 서비스', dd: ['이용안내', '이용신청', '신청확인'], link: '/' },
        { idx: 14, dt: '고객서비스헌장', dd: ['고객서비스헌장', '고객서비스헌장 이행실적'], link: '/' }
      ]
    },
    {
      id: 3, title: '문화관광', dls: [
        { idx: 1, dt: '문화행사', dd: ['이달의 문화행사', '문화행사 일정', '문화행사 신청'], link: '/' },
        { idx: 2, dt: '시티투어', dd: ['도시여행코스', '부산바다코스', '호선별 관광정보', '나만의 여행코스'], link: '/' },
        { idx: 3, dt: '갤러리', dd: ['문화행사 사진', '도시철도 사진'], link: '/' }
      ]
    },
    {
      id: 4, title: '정보공개', dls: [
        { idx: 1, dt: '공지사항', dd: ['공지사항', '고용전환 알림방'], link: '/' },
        { idx: 2, dt: '자료실', dd: ['자료실', '열차안내방송', '임직원 공무국외출장내역'], link: '/' },
        { idx: 3, dt: '정보공개 제도', dd: ['정보공개안내', '결재문서 목록', '정보공개 청구', '비공개 대상정보'], link: '/' },
        { idx: 4, dt: '사전 정보공표', dd: ['사전 정보공표', '행정정보게시판', '업무추진비 사용내역'], link: '/' },
        { idx: 5, dt: '공공데이터 개방', dd: ['공공데이터 개방', '공공데이터 수요자 의견수렴'], link: '/' },
        { idx: 6, dt: '경영공시', dd: ['경영공시', '경영계획', '예산', '경영성과', '외부평가 및 혁신', '회계결산', '경영현황', '감사정보', '이사회운영', '부산도시철도운영서비스(주) 경영고시'], link: '/' },
        { idx: 7, dt: '계약정보', dd: ['입찰안내', '발주', '입찰공고', '개찰결과', '계약현황', '감리 · 감독 · 검사 현황', '대기자금', '명세율공급증명서', '신기술 특허 공법 사용현황', '계약실적'], link: '/' },
        { idx: 8, dt: '부대사업', dd: ['광고문의', '역 구내 임대안내', '상가임대 현황', '입찰정보 사전예고', '명칭표기 신청'], link: '/' },
        { idx: 9, dt: '자산개발사업', dd: ['토지매각', '토지임대', '불용품매각', '자선개발사업 제안안내', '자산개발사업 제안등록'], link: '/' }
      ]
    },
    {
      id: 5, title: '안전/건설/기술', dls: [
        { idx: 1, dt: '안전', dd: ['안전 동영상', '안전투자공시'], link: '/' },
        { idx: 2, dt: '설비', dd: ['전기설비', '신호설비', '통신설비', '역무자동설비', '승강장 안전문 설비'], link: '/' },
        { idx: 3, dt: '도시철도 건설', dd: ['건설완료', '건설진행', '공정현황', '사업계획 승인절차', '건설구간 교통정보', '건설 동영상', '건설신기술 홍보현황', '도시철도 건설절차'], link: '/' },
        { idx: 4, dt: '전동차', dd: ['차량사업소 소개', '호선별 전동차소개', '전동차 현황 및 주요제원', '전동차 조성 현황', '전동차 주요장치 현황'], link: '/' },
        { idx: 5, dt: '시설', dd: ['토목시설', '건축시설', '궤도시설', '철도보호지구 행위신고', '연결통로 설치'], link: '/' },
        { idx: 6, dt: '환경', dd: ['공기질 관리', '소음 관리', '환경자료실', '저탄소 녹색성장'], link: '/' },
        { idx: 7, dt: '실종예방지침 시행', dd: ['실종예방지침 시행'], link: '/' },
        { idx: 8, dt: '건강한 디지털 생활', dd: ['활동자료', '추진실적'], link: '/' },
      ]
    },
    {
      id: 6, title: '공사소개', dls: [
        { idx: 1, dt: 'CEO', dd: ['인사말'], link: '/' },
        { idx: 2, dt: '일반현황', dd: ['설립목적', '공사이미지', '비전체계', '연혁', '조직 및 인력', '찾아오시는 길'], link: '/' },
        { idx: 3, dt: '사규 및 관련법령', dd: ['사규', '사규안예고', '정관 및 조례', '관련법령'], link: '/' },
        { idx: 4, dt: '도시철도 용어집', dd: ['도시철도 용어집'], link: '/' },
        { idx: 5, dt: '홍보', dd: ['보도자료', '홍보 동영상', '공식 유튜브-HUtube(휴튜브)'], link: '/' },
        { idx: 6, dt: '적극행정', dd: ['제도소개', '우수사례 · 이모저모', '적극행정 시민 추천', '소극행정 신고센터'], link: '/' },
        { idx: 7, dt: '윤리경영', dd: ['윤리경영 소개', '내부규정', '추진실적', '청렴 동영상', '반부패 청렴자료', '부패행위 징계현황', '금품 처리결과 공개', '부정청탁 공개'], link: '/' },
        { idx: 8, dt: '인권경영', dd: ['인권경영 선언문', '내부규정', '추진실적', '인권경영자료', '인권침해행위 구제 현황', '인권신고센터', '성희롱 · 성폭력 신고센터'], link: '/' },
        { idx: 9, dt: '사회공헌', dd: ['휴메트로봉사단 소개', '사회공헌활동', '사회공헌소식'], link: '/' },
        { idx: 10, dt: '채용정보', dd: ['공사 인재상', '채용안내', '공지사항', '자주하는 질문', '고졸 기능인재 추천', '청년인턴 입사지원서 작성'], link: '/' },
        { idx: 11, dt: '사이버역사관', dd: ['사이버역사관'], link: '/' },
      ]
    },

  ]

  return (
    <>
      <OnTopHeader list={topMenu} />
      <header className="header">
        <div className="container">
          <nav className="gnb">
            <h1>
              <Link to="/">
                <img src="./logo.png" alt="humetro" />
              </Link>
            </h1>
            <ul className="main_menu">
              {mainMenu.map((el, idx) => {
                return (
                  <li key={el.id}>
                    <Link to={el.link}>
                      {el.title}
                    </Link>
                    <div className="sub_wrapper">
                      <div className="container">
                        <div className="sub_left">
                          <strong>{subMenu[idx].title}</strong>
                        </div>
                        <div className="sub_right">
                          {subMenu[idx].dls.map((its, id) => {
                            return (
                              <dl key={id}>
                                <dt>
                                  {its.dt}
                                </dt>
                                {its.dd.map((ddata, idz) => {
                                  return (
                                    <dd key={idz}>
                                      <Link to={its.link}>
                                        {ddata}
                                      </Link>
                                    </dd>
                                  )
                                })}
                              </dl>
                            )
                          })}
                        </div>
                      </div>
                    </div>
                  </li>
                )
              })}
            </ul>
          </nav>
        </div>
        <MainVisual />
      </header>
    </>
  )
}

export default Header;